# DuctFittingAndAccessoryPressureDropUIData Properties

---
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace